sergz72/ARM/mspm0g350x/ti/driverlib/dl_timer.h
/** @addtogroup DL_TIMER_CC_ACOND
 *  @{
 */

/*!
 * @brief Each TIMCLK generates an advance pulse
 */
#define DL_TIMER_CC_ACOND_TIMCLK                 (GPTIMER_CCCTL_01_ACOND_TIMCLK)

/*!
 * @brief Rising edge of CCP or trigger assertion edge generates an advance
 *        pulse
 */
#define DL_TIMER_CC_ACOND_TRIG_RISE       (GPTIMER_CCCTL_01_ACOND_CC_TRIG_RISE)

/*!
 * @brief Falling edge of CCP or trigger de-assertion edge generates an advance
 *        pulse
 */
#define DL_TIMER_CC_ACOND_TRIG_FALL       (GPTIMER_CCCTL_01_ACOND_CC_TRIG_FALL)
/*!
 * @brief Either edge of CCP or trigger change (assertion/de-assertion edge)
 *        generates an advance pulse.
 */
#define DL_TIMER_CC_ACOND_TRIG_EDGE       (GPTIMER_CCCTL_01_ACOND_CC_TRIG_EDGE)
/*!
 * @brief CCP High or Trigger assertion generates an advance pulse.
 */
#define DL_TIMER_CC_ACOND_TRIG_HIGH       (GPTIMER_CCCTL_01_ACOND_CC_TRIG_HIGH)

/** @}*/

/** @addtogroup DL_TIMER_CC_CCOND
 *  @{
 */

/*!
 * @brief None (never captures)
 */
#define DL_TIMER_CC_CCOND_NOCAPTURE       (GPTIMER_CCCTL_01_CCOND_NOCAPTURE)

/*!
 * @brief Rising edge of CCP or trigger assertion edge generates a capture
 *        pulse
 */
#define DL_TIMER_CC_CCOND_TRIG_RISE       (GPTIMER_CCCTL_01_CCOND_CC_TRIG_RISE)
/*!
 * @brief Falling edge of CCP or trigger de-assertion edge generates a capture
 *        pulse
 */
#define DL_TIMER_CC_CCOND_TRIG_FALL       (GPTIMER_CCCTL_01_CCOND_CC_TRIG_FALL)
/*!
 * @brief Either edge of CCP or trigger change (assertion/de-assertion edge)
 *        generates a capture pulse
 */
#define DL_TIMER_CC_CCOND_TRIG_EDGE       (GPTIMER_CCCTL_01_CCOND_CC_TRIG_EDGE)

/** @}*/


/** @addtogroup DL_TIMER_CC_OCTL_INIT_VAL
 *  @{
 */
/*!
 * @brief CCP is low while output is disabled
 */
#define DL_TIMER_CC_OCTL_INIT_VAL_LOW              (GPTIMER_OCTL_01_CCPIV_LOW)

/*!
 * @brief CCP is high while output is disabled
 */
#define DL_TIMER_CC_OCTL_INIT_VAL_HIGH             (GPTIMER_OCTL_01_CCPIV_HIGH)

/** @}*/

/** @addtogroup DL_TIMER_CC_OCTL_INV_OUT
 *  @{
 */
/*!
 * @brief CCP Output inversion is enabled
 */
#define DL_TIMER_CC_OCTL_INV_OUT_ENABLED        (GPTIMER_OCTL_01_CCPOINV_INV)

/*!
 * @brief CCP Output inversion is disabled
 */
#define DL_TIMER_CC_OCTL_INV_OUT_DISABLED       (GPTIMER_OCTL_01_CCPOINV_NOINV)

/** @}*/

/** @addtogroup DL_TIMER_CC_OCTL_SRC
 *  @{
 */
/*!
 * @brief Output controlled by function values (e.g. PWM)
 */
#define DL_TIMER_CC_OCTL_SRC_FUNCVAL       (GPTIMER_OCTL_01_CCPO_FUNCVAL)

/*!
 * @brief Output controlled by load event
 */
#define DL_TIMER_CC_OCTL_SRC_LOAD          (GPTIMER_OCTL_01_CCPO_LOAD)

/*!
 * @brief Output controlled by compare value = counter condition.
 */
#define DL_TIMER_CC_OCTL_SRC_CMPVAL        (GPTIMER_OCTL_01_CCPO_CMPVAL)

/*!
 * @brief Output controlled by zero event.
 */
#define DL_TIMER_CC_OCTL_SRC_ZERO          (GPTIMER_OCTL_01_CCPO_ZERO)

/*!
 * @brief Output controlled by capture event.
 */
#define DL_TIMER_CC_OCTL_SRC_CAPCOND       (GPTIMER_OCTL_01_CCPO_CAPCOND)

/*!
 * @brief Output controlled by fault condition.
 */
#define DL_TIMER_CC_OCTL_SRC_FAULTCOND       (GPTIMER_OCTL_01_CCPO_FAULTCOND)

/*!
 * @brief Mirror CCP of first capture and compare register in counter group.
 */
#define DL_TIMER_CC_OCTL_SRC_CC0_MIRR_ALL  (GPTIMER_OCTL_01_CCPO_CC0_MIRROR_ALL)

/*!
 * @brief Mirror CCP of second capture and compare register in counter group.
 */
#define DL_TIMER_CC_OCTL_SRC_CC1_MIRR_ALL  (GPTIMER_OCTL_01_CCPO_CC1_MIRROR_ALL)

/*!
 * @brief Dead band inserted output
 */
#define DL_TIMER_CC_OCTL_SRC_DEAD_BAND           (GPTIMER_OCTL_01_CCPO_DEADBAND)

/*!
 * @brief Counter direction.
 */
#define DL_TIMER_CC_OCTL_SRC_CNTDIR                (GPTIMER_OCTL_01_CCPO_CNTDIR)
/** @}*/

/** @addtogroup DL_TIMER_CC_SWFRCACT_CMPL
 *  @{
 */

/*!
 * @brief The CCP complimentary output value is unaffected by the event.
 */
#define DL_TIMER_CC_SWFRCACT_CMPL_DISABLED           (GPTIMER_CCACT_01_SWFRCACT_CMPL_DISABLED)

/*!
 * @brief CCP complimentary output value is set high.
 */
#define DL_TIMER_CC_SWFRCACT_CMPL_HIGH               (GPTIMER_CCACT_01_SWFRCACT_CMPL_CCP_HIGH)

/*!
 * @brief CCP complimentary output value is set low.
 */
#define DL_TIMER_CC_SWFRCACT_CMPL_LOW                 (GPTIMER_CCACT_01_SWFRCACT_CMPL_CCP_LOW)

/** @}*/

/** @addtogroup DL_TIMER_CC_SWFRCACT
 *  @{
 */

/*!
 * @brief The CCP output value is unaffected by the event.
 */
#define DL_TIMER_CC_SWFRCACT_DISABLED           (GPTIMER_CCACT_01_SWFRCACT_DISABLED)

/*!
 * @brief CCP output value is set high.
 */
#define DL_TIMER_CC_SWFRCACT_HIGH               (GPTIMER_CCACT_01_SWFRCACT_CCP_HIGH)

/*!
 * @brief CCP output value is set low.
 */
#define DL_TIMER_CC_SWFRCACT_LOW                 (GPTIMER_CCACT_01_SWFRCACT_CCP_LOW)

/** @}*/

/** @addtogroup DL_TIMER_CC_FEXACT
 *  @{
 */

/*!
 * @brief The CCP output value is unaffected by the event.
 */
#define DL_TIMER_CC_FEXACT_DISABLED           (GPTIMER_CCACT_01_FEXACT_DISABLED)

/*!
 * @brief CCP output value is set high.
 */
#define DL_TIMER_CC_FEXACT_HIGH               (GPTIMER_CCACT_01_FEXACT_CCP_HIGH)

/*!
 * @brief CCP output value is set low.
 */
#define DL_TIMER_CC_FEXACT_LOW                 (GPTIMER_CCACT_01_FEXACT_CCP_LOW)

/*!
 * @brief CCP output value is toggled.
 */
#define DL_TIMER_CC_FEXACT_TOGGLE           (GPTIMER_CCACT_01_FEXACT_CCP_TOGGLE)


/*!
 * @brief CCP output value is Hi-Z.
 */
#define DL_TIMER_CC_FEXACT_HIGHZ           (GPTIMER_CCACT_01_FEXACT_CCP_HIGHZ)


/** @}*/

/** @addtogroup DL_TIMER_CC_FENACT
 *  @{
 */

/*!
 * @brief The CCP output value is unaffected by the event.
 */
#define DL_TIMER_CC_FENACT_DISABLED           (GPTIMER_CCACT_01_FENACT_DISABLED)

/*!
 * @brief CCP output value is set high.
 */
#define DL_TIMER_CC_FENACT_CCP_HIGH           (GPTIMER_CCACT_01_FENACT_CCP_HIGH)

/*!
 * @brief CCP output value is set low
 */
#define DL_TIMER_CC_FENACT_CCP_LOW             (GPTIMER_CCACT_01_FENACT_CCP_LOW)

/*!
 * @brief CCP output value is toggled.
 */
#define DL_TIMER_CC_FENACT_CCP_TOGGLE      \
                                            (GPTIMER_CCACT_01_FENACT_CCP_TOGGLE)

/*!
 * @brief CCP output value is Hi-Z.
 */
#define DL_TIMER_CC_FENACT_HIGHZ           (GPTIMER_CCACT_01_FENACT_CCP_HIGHZ)


/** @}*/

/** @addtogroup DL_TIMER_CC_CC2UACT
 *  @{
 */

/*!
 * @brief The CCP output value is unaffected by the event.
 */
#define DL_TIMER_CC_CC2UACT_DISABLED           (GPTIMER_CCACT_01_CC2UACT_DISABLED)

/*!
 * @brief CCP output value is set high.
 */
#define DL_TIMER_CC_CC2UACT_CCP_HIGH           (GPTIMER_CCACT_01_CC2UACT_CCP_HIGH)

/*!
 * @brief CCP output value is set low
 */
#define DL_TIMER_CC_CC2UACT_CCP_LOW             (GPTIMER_CCACT_01_CC2UACT_CCP_LOW)

/*!
 * @brief CCP output value is toggled.
 */
#define DL_TIMER_CC_CC2UACT_CCP_TOGGLE      \
                                            (GPTIMER_CCACT_01_CC2UACT_CCP_TOGGLE)

/** @}*/

/** @addtogroup DL_TIMER_CC_CC2DACT
 *  @{
 */

/*!
 * @brief The CCP output value is unaffected by the event.
 */
#define DL_TIMER_CC_CC2DACT_DISABLED           (GPTIMER_CCACT_01_CC2DACT_DISABLED)

/*!
 * @brief CCP output value is set high.
 */
#define DL_TIMER_CC_CC2DACT_CCP_HIGH           (GPTIMER_CCACT_01_CC2DACT_CCP_HIGH)

/*!
 * @brief CCP output value is set low
 */
#define DL_TIMER_CC_CC2DACT_CCP_LOW             (GPTIMER_CCACT_01_CC2DACT_CCP_LOW)

/*!
 * @brief CCP output value is toggled.
 */
#define DL_TIMER_CC_CC2DACT_CCP_TOGGLE      \
                                            (GPTIMER_CCACT_01_CC2DACT_CCP_TOGGLE)

/** @}*/

