sergz72/ARM/mspm0g350x/ti/driverlib/dl_timer.h
/**
 *  @brief      Configure Cross Timer Trigger
 *
 *  @param[in]  gptimer           Pointer to the register overlay for the
 *                                peripheral
 *  @param[in]  ctSource          Selects cross trigger source.
 *                                @ref DL_TIMER_CROSS_TRIG_SRC
 *
 *  @param[in]  enInTrigCond      Cofigures Input Trigger Conditions to the
 *                                Timer module as a condition for Cross Triggers *                                @ref DL_TIMER_CROSS_TRIGGER_INPUT
 *
 * @param[in]  enCrossTrig        Configures Timer Cross trigger
 *                                @ref DL_TIMER_CROSS_TRIGGER_MODE
 *
 */
__STATIC_INLINE void DL_Timer_configCrossTrigger(GPTIMER_Regs *gptimer,
    DL_TIMER_CROSS_TRIG_SRC ctSource,
    DL_TIMER_CROSS_TRIGGER_INPUT enInTrigCond,
    DL_TIMER_CROSS_TRIGGER_MODE enCrossTrig)
{
    gptimer->COMMONREGS.CTTRIGCTL =
        (uint32_t)((uint32_t) ctSource | (uint32_t) enInTrigCond |
                   (uint32_t) enCrossTrig);
}

/**
 *  @brief      Configure Cross Timer Trigger source
 *
 *  @param[in]  gptimer           Pointer to the register overlay for the
 *                                peripheral
  *  @param[in]  ctSource          Selects cross trigger source.
 *                                @ref DL_TIMER_CROSS_TRIG_SRC
 *
 */
__STATIC_INLINE void DL_Timer_configCrossTriggerSrc(
    GPTIMER_Regs *gptimer, DL_TIMER_CROSS_TRIG_SRC ctSource)
{
    DL_Common_updateReg(&gptimer->COMMONREGS.CTTRIGCTL, (uint32_t) ctSource,
        GPTIMER_CTTRIGCTL_EVTCTTRIGSEL_MASK);
}

/**
 *  @brief      Enables/DIsables Input Trigger condition for Cross Timer Trigger
 *
 *  @param[in]  gptimer           Pointer to the register overlay for the
 *                                peripheral
 *
 *  @param[in]  enInTrigCond      Cofigures Input Trigger Conditions to the
 *                                Timer module as a condition for Cross Triggers
 *                                @ref DL_TIMER_CROSS_TRIGGER_INPUT
 *
 */
__STATIC_INLINE void DL_Timer_configCrossTriggerInputCond(
    GPTIMER_Regs *gptimer, DL_TIMER_CROSS_TRIGGER_INPUT enInTrigCond)
{
    DL_Common_updateReg(&gptimer->COMMONREGS.CTTRIGCTL,
        (uint32_t) enInTrigCond, GPTIMER_CTTRIGCTL_EVTCTEN_MASK);
}

/**
 *  @brief      Enable/Disable Cross Timer Trigger
 *
 *  @param[in]  gptimer           Pointer to the register overlay for the
 *                                peripheral
 * @param[in]  enCrossTrig        Configures Timer Cross trigger
 *                                @ref DL_TIMER_CROSS_TRIGGER_MODE
 *
 */
__STATIC_INLINE void DL_Timer_configCrossTriggerEnable(
    GPTIMER_Regs *gptimer, DL_TIMER_CROSS_TRIGGER_MODE enCrossTrig)
{
    DL_Common_updateReg(&gptimer->COMMONREGS.CTTRIGCTL, (uint32_t) enCrossTrig,
        GPTIMER_CTTRIGCTL_CTEN_MASK);
}

/**
 *  @brief      Get Cross Timer Trigger configuration
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *
 *  @return Bitwise OR of @ref DL_TIMER_CROSS_TRIG_SRC,
 *          @ref DL_TIMER_CROSS_TRIGGER_INPUT, @ref DL_TIMER_CROSS_TRIGGER_MODE,
 *
 */
__STATIC_INLINE uint32_t DL_Timer_getCrossTriggerConfig(GPTIMER_Regs *gptimer)
{
    return (gptimer->COMMONREGS.CTTRIGCTL);
}

/**
 *  @brief      Get Cross Timer Trigger source
 *
 *  @param[in]  gptimer           Pointer to the register overlay for the
 *                                peripheral
 *
 *  @return One of @ref DL_TIMER_CROSS_TRIG_SRC
 *
 */
__STATIC_INLINE DL_TIMER_CROSS_TRIG_SRC DL_Timer_getCrossTriggerSrc(
    GPTIMER_Regs *gptimer)
{
    uint32_t ctSource =
        gptimer->COMMONREGS.CTTRIGCTL & GPTIMER_CTTRIGCTL_EVTCTTRIGSEL_MASK;

    return (DL_TIMER_CROSS_TRIG_SRC)(ctSource);
}

/**
 *  @brief      Get Input Trigger condition for Cross Timer Trigger
 *
 *  @param[in]  gptimer           Pointer to the register overlay for the
 *                                peripheral
 *
 *  @return One of @ref DL_TIMER_CROSS_TRIGGER_INPUT
 *
 */
__STATIC_INLINE DL_TIMER_CROSS_TRIGGER_INPUT DL_Timer_getCrossTriggerInputCond(
    GPTIMER_Regs *gptimer)
{
    uint32_t triggerCondition =
        gptimer->COMMONREGS.CTTRIGCTL & GPTIMER_CTTRIGCTL_EVTCTEN_MASK;

    return (DL_TIMER_CROSS_TRIGGER_INPUT)(triggerCondition);
}

/**
 *  @brief      Checks if Cross Timer Trigger is enabled or disabled
 *
 *  @param[in]  gptimer           Pointer to the register overlay for the
 *                                peripheral
 *
 *  @return One of @ref DL_TIMER_CROSS_TRIGGER_MODE
 *
 */
__STATIC_INLINE DL_TIMER_CROSS_TRIGGER_MODE DL_Timer_getCrossTriggerEnable(
    GPTIMER_Regs *gptimer)
{
    uint32_t mode =
        gptimer->COMMONREGS.CTTRIGCTL & GPTIMER_CTTRIGCTL_CTEN_MASK;

    return (DL_TIMER_CROSS_TRIGGER_MODE)(mode);
}

/**
 *  @brief      Generates a synchronized trigger condition across all trigger
 *              enabled Timer instances
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 */
__STATIC_INLINE void DL_Timer_generateCrossTrigger(GPTIMER_Regs *gptimer)
{
    gptimer->COMMONREGS.CTTRIG = GPTIMER_CTTRIG_TRIG_GENERATE;
}

/**
 *  @brief      Enable shadow to activate load of buffered registers and
 *              register fields.
 *
 *  @note Please refer to the device datasheet to determine shadow features
 *        avaialable per timer instance.
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 */
__STATIC_INLINE void DL_Timer_enableShadowFeatures(GPTIMER_Regs *gptimer)
{
    gptimer->COMMONREGS.GCTL |= GPTIMER_GCTL_SHDWLDEN_ENABLE;
}

/**
 *  @brief      Disable shadow to activate load of buffered registers and
 *              register fields.
 *
 *  @note Please refer to the device datasheet to determine shadow features
 *        avaialable per timer instance.
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 */
__STATIC_INLINE void DL_Timer_disableShadowFeatures(GPTIMER_Regs *gptimer)
{
    gptimer->COMMONREGS.GCTL &= ~(GPTIMER_GCTL_SHDWLDEN_ENABLE);
}

/**
 *  @brief      Sets timer LOAD register value
 *
 *  @param[in]  gptimer      Pointer to the register overlay for the
 *                           peripheral
 *  @param[in]  value        Value to be loaded to timer LOAD
 *                           register. Refer to the device datasheet to
 *                           determine the bit width of the counter for
 *                           the selected Timer instance.
 *
 */
__STATIC_INLINE void DL_Timer_setLoadValue(
    GPTIMER_Regs *gptimer, uint32_t value)
{
    gptimer->COUNTERREGS.LOAD = value;
}

/**
 *  @brief      Gets the timer LOAD register value
 *
 *  @param[in]  gptimer      Pointer to the register overlay for the
 *                           peripheral
 *
 *  @return     Returns the timer's LOAD register value.
 *
 */
__STATIC_INLINE uint32_t DL_Timer_getLoadValue(GPTIMER_Regs *gptimer)
{
    return (gptimer->COUNTERREGS.LOAD & GPTIMER_LOAD_LD_MAXIMUM);
}

/**
 *  @brief      Gets the current counter value of the timer
 *
 *  @param[in]  gptimer      Pointer to the register overlay for the
 *                           peripheral
 *
 *  @return     Returns the timer counter value
 */
__STATIC_INLINE uint32_t DL_Timer_getTimerCount(GPTIMER_Regs *gptimer)
{
    return (gptimer->COUNTERREGS.CTR & GPTIMER_CTR_CCTR_MASK);
}

/**
 *  @brief      Set timer counter value
 *
 *  @note       <b>Warning</b> setting the counter value directly while the
 *              timer's counter is running can lead to unpredictable behavior.
 *              This function should only be used when the timer's counter
 *              isn't running. If you need to change the counter value while
 *              it is running then use DL_Timer_setLoadValue(). For TimerH use
 *              DL_TimerH_setLoadValue() instead. These functions will
 *              update the LOAD register which will safely copy its
 *              value to the counter register.
 *
 *  @param[in]  gptimer      Pointer to the register overlay for the
 *                           peripheral
 *  @param[in]  value        Value to set the timer counter value to
 *
 */
__STATIC_INLINE void DL_Timer_setTimerCount(
    GPTIMER_Regs *gptimer, uint32_t value)
{
    gptimer->COUNTERREGS.CTR = value;
}

/**
 *  @brief     Enable suppression of load and zero events
 *
 *  @note Refer to device datasheet to determine if timer instance supports
 *  this feature. Only Timer instance which supports Repeat Counter supports
 *  this feature.
 *
 *  @param[in]  gptimer         Pointer to the register overlay for the
 *                              peripheral
 *
 */
__STATIC_INLINE void DL_Timer_enableLZEventSuppression(GPTIMER_Regs *gptimer)
{
    gptimer->COUNTERREGS.CTRCTL |= (GPTIMER_CTRCTL_SLZERCNEZ_ENABLED);
}

/**
 *  @brief     Disable suppression of load and zero events
 *
 *  @note Refer to device datasheet to determine if timer instance supports
 *  this feature. Only Timer instances which supports Repeat Counter supports
 *  this feature.
 *
 *  @param[in]  gptimer         Pointer to the register overlay for the
 *                              peripheral
 *
 */
__STATIC_INLINE void DL_Timer_disableLZEventSuppression(GPTIMER_Regs *gptimer)
{
    gptimer->COUNTERREGS.CTRCTL &= ~(GPTIMER_CTRCTL_SLZERCNEZ_ENABLED);
}

/**
 *  @brief     Checks if suppression of load and zero events is enabled
 *
 *  @param[in]  gptimer         Pointer to the register overlay for the
 *                              peripheral
 *  @return Returns the status ofsuppression of load and zero events
 *
 *  @retval     true  suppression of load and zero events is enabled
 *  @retval     false suppression of load and zero events is disabled
 *
 */
__STATIC_INLINE bool DL_Timer_isLZEventSuppressionEnabled(
    GPTIMER_Regs *gptimer)
{
    return (GPTIMER_CTRCTL_SLZERCNEZ_ENABLED ==
            (gptimer->COUNTERREGS.CTRCTL & GPTIMER_CTRCTL_SLZERCNEZ_MASK));
}

/**
 *  @brief     Configures timer behavior during debug release/exit
 *
 *
 *  @param[in]  gptimer         Pointer to the register overlay for the
 *                              peripheral
 *  @param[in]  debResB       Specifies timer behavior upon
 *                              relase/exit of debug mode.
 *                              @ref DL_TIMER_DEBUG_RES
 *
 */
__STATIC_INLINE void DL_Timer_setDebugReleaseBehavior(
    GPTIMER_Regs *gptimer, DL_TIMER_DEBUG_RES debResB)
{
    DL_Common_updateReg(&gptimer->COUNTERREGS.CTRCTL, (uint32_t) debResB,
        GPTIMER_CTRCTL_DRB_MASK);
}

/**
 *  @brief     Get timer resume behavior after relase/exit of debug mode.
 *
 *  @param[in]  gptimer         Pointer to the register overlay for the
 *                              peripheral
 *  @return @ref DL_TIMER_DEBUG_RES
 *
 */
__STATIC_INLINE DL_TIMER_DEBUG_RES DL_Timer_getDebugReleaseBehavior(
    GPTIMER_Regs *gptimer)
{
    uint32_t debResB = gptimer->COUNTERREGS.CTRCTL & GPTIMER_CTRCTL_DRB_MASK;

    return ((DL_TIMER_DEBUG_RES)(debResB));
}

/**
 *  @brief     Configure timer counter control operation
 *
 *  @param[in]  gptimer         Pointer to the register overlay for the
 *                              peripheral
 *  @param[in]  zeroCtl         Specifies event which zeroes the counter value.
 *                              @ref DL_TIMER_CZC
 *  @param[in]  advCtl          Specifies event which increments or
 *                              decrements the counter value.
 *                              @ref DL_TIMER_CAC
 *  @param[in]  loadCtl         Specifies event which sets counter value
 *                              with LD register value.
 *                              @ref DL_TIMER_CLC
 */
__STATIC_INLINE void DL_Timer_setCounterControl(GPTIMER_Regs *gptimer,
    DL_TIMER_CZC zeroCtl, DL_TIMER_CAC advCtl, DL_TIMER_CLC loadCtl)
{
    DL_Common_updateReg(&gptimer->COUNTERREGS.CTRCTL,
        ((uint32_t) zeroCtl | (uint32_t) advCtl | (uint32_t) loadCtl),
        (GPTIMER_CTRCTL_CZC_MASK | GPTIMER_CTRCTL_CAC_MASK |
            GPTIMER_CTRCTL_CLC_MASK));
}

/**
 *  @brief     Get timer counter zero control operation
 *
 *  @param[in]  gptimer         Pointer to the register overlay for the
 *                              peripheral
 *  @return @ref DL_TIMER_CZC
 */
__STATIC_INLINE DL_TIMER_CZC DL_Timer_getCounterZeroControl(
    GPTIMER_Regs *gptimer)
{
    uint32_t zeroCtl = gptimer->COUNTERREGS.CTRCTL & GPTIMER_CTRCTL_CZC_MASK;

    return ((DL_TIMER_CZC)(zeroCtl));
}

/**
 *  @brief     Get timer counter advance control operation
 *
 *  @param[in]  gptimer         Pointer to the register overlay for the
 *                              peripheral
 *  @return @ref DL_TIMER_CAC
 */
__STATIC_INLINE DL_TIMER_CAC DL_Timer_getCounterAdvanceControl(
    GPTIMER_Regs *gptimer)
{
    uint32_t advCtl = gptimer->COUNTERREGS.CTRCTL & GPTIMER_CTRCTL_CAC_MASK;

